---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroManagerIterator.MoveNext
source: html/4f963534-7c32-d593-3f25-fefa7fc35a2a.htm
---
# Autodesk.Revit.DB.Macros.MacroManagerIterator.MoveNext Method

Increments the iterator to the next item.

## Syntax (C#)
```csharp
public virtual bool MoveNext()
```

## Returns
True if there is a next available item in this iterator.
 False if the iterator has completed all available items.